In [11]:
import pandas as pd
import numpy as np

In [12]:
line1 = pd.read_csv("./dataProcessed/line_1_data.csv")
line4 = pd.read_csv("./dataProcessed/line_4_data.csv")
lineAir = pd.read_csv("./dataProcessed/line_air_data.csv")
lineGyeongui = pd.read_csv("./dataProcessed/line_gyeongui_data.csv")

In [13]:
line1.isnull().sum()

사용일자      0
노선명       0
역명        0
승차총승객수    0
하차총승객수    0
dtype: int64

In [14]:
line4.isnull().sum()

사용일자      0
노선명       0
역명        0
승차총승객수    0
하차총승객수    0
dtype: int64

In [15]:
lineAir.isnull().sum()

사용일자      0
노선명       0
역명        0
승차총승객수    0
하차총승객수    0
dtype: int64

In [16]:
lineGyeongui.isnull().sum()

사용일자      0
노선명       0
역명        0
승차총승객수    0
하차총승객수    0
dtype: int64

In [ ]:
line1 = line1[['사용일자', '승차총승객수', '하차총승객수']]
line4 = line4[['사용일자', '승차총승객수', '하차총승객수']]
lineAir = lineAir[['사용일자', '승차총승객수', '하차총승객수']]
lineGyeongui = lineGyeongui[['사용일자', '승차총승객수', '하차총승객수']]

In [23]:
df = pd.merge(line1, line4, how='outer', on='사용일자')
df.head(10)

         사용일자  승차총승객수_x  하차총승객수_x  승차총승객수_y  하차총승객수_y
0  2015-01-01     40197     40197    3943.0   10823.0
1  2015-01-02     67738     67738   10630.0   19989.0
2  2015-01-03     51578     51578    6091.0   15151.0
3  2015-01-04     43401     43401    5099.0   12195.0
4  2015-01-05     64859     64859   11648.0   19142.0
5  2015-01-06     63640     63640   12691.0   19450.0
6  2015-01-07     63105     63105   12771.0   19369.0
7  2015-01-08     64556     64556   12408.0   19912.0
8  2015-01-09     73483     73483   13222.0   21858.0
9  2015-01-10     61169     61169    7579.0   18590.0

In [25]:
df = df.rename(columns={'승차총승객수_x':'1호선승차', '하차총승객수_x' : '1호선하차', 
                        '승차총승객수_y':'4호선승차', '하차총승객수_y' : '4호선하차'})

In [26]:
df.head(10)

         사용일자  1호선승차  1호선하차    4호선승차    4호선하차
0  2015-01-01  40197  40197   3943.0  10823.0
1  2015-01-02  67738  67738  10630.0  19989.0
2  2015-01-03  51578  51578   6091.0  15151.0
3  2015-01-04  43401  43401   5099.0  12195.0
4  2015-01-05  64859  64859  11648.0  19142.0
5  2015-01-06  63640  63640  12691.0  19450.0
6  2015-01-07  63105  63105  12771.0  19369.0
7  2015-01-08  64556  64556  12408.0  19912.0
8  2015-01-09  73483  73483  13222.0  21858.0
9  2015-01-10  61169  61169   7579.0  18590.0

In [27]:
lineAir = lineAir.rename(columns={'승차총승객수' : '공항철도승차', '하차총승객수' : '공항철도하차'} )
lineGyeongui = lineGyeongui.rename(columns={'승차총승객수' : '경의선승차', '하차총승객수' : '경의선하차'} )

In [28]:
df = pd.merge(df, lineAir, how='outer', on='사용일자')
df.head(10)

         사용일자  1호선승차  1호선하차    4호선승차    4호선하차   공항철도승차   공항철도하차
0  2015-01-01  40197  40197   3943.0  10823.0  12059.0  12439.0
1  2015-01-02  67738  67738  10630.0  19989.0  17936.0  18401.0
2  2015-01-03  51578  51578   6091.0  15151.0  15544.0  15976.0
3  2015-01-04  43401  43401   5099.0  12195.0  14880.0  14033.0
4  2015-01-05  64859  64859  11648.0  19142.0  17461.0  17640.0
5  2015-01-06  63640  63640  12691.0  19450.0  16567.0  16825.0
6  2015-01-07  63105  63105  12771.0  19369.0  16650.0  16557.0
7  2015-01-08  64556  64556  12408.0  19912.0  16726.0  16885.0
8  2015-01-09  73483  73483  13222.0  21858.0  19104.0  19879.0
9  2015-01-10  61169  61169   7579.0  18590.0  17096.0  18591.0

In [29]:
df = pd.merge(df, lineGyeongui, how='outer', on='사용일자')
df.head(10)

,사용일자,1호선승차,1호선하차,4호선승차,4호선하차,공항철도승차,공항철도하차,경의선승차,경의선하차
0,2015-01-01,40197,40197,3943.0,10823.0,12059.0,12439.0,1789.0,1084.0
1,2015-01-02,67738,67738,10630.0,19989.0,17936.0,18401.0,3743.0,3476.0
2,2015-01-03,51578,51578,6091.0,15151.0,15544.0,15976.0,2357.0,1666.0
3,2015-01-03,51578,51578,6091.0,15151.0,15544.0,15976.0,1.0,0.0
4,2015-01-04,43401,43401,5099.0,12195.0,14880.0,14033.0,2287.0,1303.0
5,2015-01-05,64859,64859,11648.0,19142.0,17461.0,17640.0,4240.0,4067.0
6,2015-01-06,63640,63640,12691.0,19450.0,16567.0,16825.0,3899.0,3795.0
7,2015-01-07,63105,63105,12771.0,19369.0,16650.0,16557.0,3773.0,3712.0
8,2015-01-08,64556,64556,12408.0,19912.0,16726.0,16885.0,3801.0,3817.0
9,2015-01-09,73483,73483,13222.0,21858.0,19104.0,19879.0,4334.0,4299.0

In [31]:
df = df.rename(columns={"탑승일자" : "사용일자"})

In [38]:
df.isnull().sum()

사용일자       0
1호선승차      0
1호선하차      0
4호선승차      1
4호선하차      1
공항철도승차     1
공항철도하차     1
경의선승차     14
경의선하차     14
dtype: int64

In [ ]:
df.to_csv("./dataProcessed/line_total.csv")

Empty DataFrame
Columns: [사용일자, 1호선승차, 1호선하차, 4호선승차, 4호선하차, 공항철도승차, 공항철도하차, 경의선승차, 경의선하차]
Index: []

## 버전2 만들기

In [202]:
df2 = pd.DataFrame()
df2['탑승일자'] = df['사용일자']
df2['1호선'] = df['1호선승차'] + df['1호선하차']
df2['4호선'] = df['4호선승차'] + df['4호선하차']
df2['공항철도'] = df['공항철도승차'] + df['공항철도하차']
df2['경의선'] = df['경의선승차'] + df['경의선하차']

In [203]:
df2.head(10)

         탑승일자     1호선      4호선     공항철도     경의선
0  2015-01-01   80394  14766.0  24498.0  2873.0
1  2015-01-02  135476  30619.0  36337.0  7219.0
2  2015-01-03  103156  21242.0  31520.0  4023.0
3  2015-01-03  103156  21242.0  31520.0     1.0
4  2015-01-04   86802  17294.0  28913.0  3590.0
5  2015-01-05  129718  30790.0  35101.0  8307.0
6  2015-01-06  127280  32141.0  33392.0  7694.0
7  2015-01-07  126210  32140.0  33207.0  7485.0
8  2015-01-08  129112  32320.0  33611.0  7618.0
9  2015-01-09  146966  35080.0  38983.0  8633.0

In [204]:
df2.head(10)

         탑승일자     1호선      4호선     공항철도     경의선
0  2015-01-01   80394  14766.0  24498.0  2873.0
1  2015-01-02  135476  30619.0  36337.0  7219.0
2  2015-01-03  103156  21242.0  31520.0  4023.0
3  2015-01-03  103156  21242.0  31520.0     1.0
4  2015-01-04   86802  17294.0  28913.0  3590.0
5  2015-01-05  129718  30790.0  35101.0  8307.0
6  2015-01-06  127280  32141.0  33392.0  7694.0
7  2015-01-07  126210  32140.0  33207.0  7485.0
8  2015-01-08  129112  32320.0  33611.0  7618.0
9  2015-01-09  146966  35080.0  38983.0  8633.0

In [205]:
precip = pd.read_csv("./dataProcessed/precipitation.csv")
temp = pd.read_csv("./dataProcessed/temperature.csv")

In [206]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3888 entries, 0 to 3887
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   탑승일자    3888 non-null   object
 1   1호선     3888 non-null   int64
 2   4호선     3887 non-null   float64
 3   공항철도    3887 non-null   float64
 4   경의선     3874 non-null   float64
dtypes: float64(3), int64(1), object(1)
memory usage: 152.0+ KB

In [207]:
precip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3592 entries, 0 to 3591
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   탑승일자    3592 non-null   object
 1   type    3592 non-null   int64
dtypes: int64(1), object(1)
memory usage: 56.3+ KB

In [208]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3614 entries, 0 to 3613
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   탑승일자    3614 non-null   object
 1   평균기온    3614 non-null   float64
 2   최고기온    3614 non-null   float64
 3   최저기온    3614 non-null   float64
dtypes: float64(3), object(1)
memory usage: 113.1+ KB

In [209]:
df2 = pd.merge(df2, precip, how='outer', on='탑승일자')

In [210]:
df2 = df2.rename(columns={"type" : "강수량범주"})

In [211]:
df2 = pd.merge(df2, temp, how='outer', on='탑승일자')

In [212]:
df2.head(5)

         탑승일자       1호선      4호선     공항철도     경의선  강수량범주  평균기온  최고기온  최저기온
0  2015-01-01   80394.0  14766.0  24498.0  2873.0    0.0  -7.7  -4.3  -9.8
1  2015-01-02  135476.0  30619.0  36337.0  7219.0    0.0  -6.0  -1.9  -9.0
2  2015-01-03  103156.0  21242.0  31520.0  4023.0    0.0  -2.7   3.1  -9.2
3  2015-01-03  103156.0  21242.0  31520.0     1.0    0.0  -2.7   3.1  -9.2
4  2015-01-04   86802.0  17294.0  28913.0  3590.0    0.0   2.5   8.5   0.2

In [213]:
busstop = pd.read_csv("./dataProcessed/busstop.csv")
print(busstop.info())
print(busstop.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10763 entries, 0 to 10762
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   탑승일자        10763 non-null  object
 1   버스정류장ARS번호  10763 non-null  int64
 2   총승객수        10763 non-null  float64
 3   승차총승객수      10763 non-null  float64
 4   하차총승객수      10763 non-null  float64
dtypes: float64(3), int64(1), object(1)
memory usage: 420.6+ KB
None
         탑승일자  버스정류장ARS번호    총승객수  승차총승객수  하차총승객수
0  2015-01-01        2003  1036.0   317.0   719.0
1  2015-01-01        2006  4239.0  2802.0  1437.0
2  2015-01-01        2282   706.0   126.0   580.0
3  2015-01-02        2003  1920.0   507.0  1413.0
4  2015-01-02        2006  7239.0  4557.0  2682.0

In [214]:
busstop['탑승일자'] = pd.to_datetime(busstop['탑승일자'])

In [215]:
busstop1 = busstop[busstop['버스정류장ARS번호'] == 2003]
busstop2 = busstop[busstop['버스정류장ARS번호'] == 2006]
busstop3 = busstop[busstop['버스정류장ARS번호'] == 2282]

busstop1 = busstop1[['탑승일자', '총승객수']]
busstop2 = busstop2[['탑승일자', '총승객수']]
busstop3 = busstop3[['탑승일자', '총승객수']]

In [216]:
busstop1 = busstop1.rename(columns={'총승객수' : '버스정류장1_총승객수'})
busstop1.head()

         탑승일자  버스정류장1_총승객수
0  2015-01-01       1036.0
3  2015-01-02       1920.0
6  2015-01-03       1507.0
9  2015-01-04       1329.0
12 2015-01-05       2070.0

In [217]:
df2['탑승일자'] = pd.to_datetime(df2['탑승일자'])

In [218]:
df2 = pd.merge(df2, busstop1, how='outer', on='탑승일자')
df2.head(10)

,탑승일자,1호선,4호선,공항철도,경의선,강수량범주,평균기온,최고기온,최저기온,버스정류장1_총승객수
0,2015-01-01,80394.0,14766.0,24498.0,2873.0,0.0,-7.7,-4.3,-9.8,1036.0
1,2015-01-02,135476.0,30619.0,36337.0,7219.0,0.0,-6.0,-1.9,-9.0,1920.0
2,2015-01-03,103156.0,21242.0,31520.0,4023.0,0.0,-2.7,3.1,-9.2,1507.0
3,2015-01-03,103156.0,21242.0,31520.0,1.0,0.0,-2.7,3.1,-9.2,1507.0
4,2015-01-04,86802.0,17294.0,28913.0,3590.0,0.0,2.5,8.5,0.2,1329.0
5,2015-01-05,129718.0,30790.0,35101.0,8307.0,1.0,3.7,7.9,-1.1,2070.0
6,2015-01-06,127280.0,32141.0,33392.0,7694.0,1.0,-3.2,4.0,-7.6,2012.0
7,2015-01-07,126210.0,32140.0,33207.0,7485.0,0.0,-5.5,-0.6,-8.9,2063.0
8,2015-01-08,129112.0,32320.0,33611.0,7618.0,0.0,-5.1,-0.2,-9.5,1978.0
9,2015-01-09,146966.0,35080.0,38983.0,8633.0,0.0,-2.1,3.5,-6.8,2257.0

In [219]:
busstop2 = busstop2.rename(columns={'총승객수' : '버스정류장2_총승객수'})
df2 = pd.merge(df2, busstop2, how='outer', on='탑승일자')
df2

,탑승일자,1호선,4호선,공항철도,경의선,강수량범주,평균기온,최고기온,최저기온,버스정류장1_총승객수,버스정류장2_총승객수
0,2015-01-01,80394.0,14766.0,24498.0,2873.0,0.0,-7.7,-4.3,-9.8,1036.0,4239.0
1,2015-01-02,135476.0,30619.0,36337.0,7219.0,0.0,-6.0,-1.9,-9.0,1920.0,7239.0
2,2015-01-03,103156.0,21242.0,31520.0,4023.0,0.0,-2.7,3.1,-9.2,1507.0,5746.0
3,2015-01-03,103156.0,21242.0,31520.0,1.0,0.0,-2.7,3.1,-9.2,1507.0,5746.0
4,2015-01-04,86802.0,17294.0,28913.0,3590.0,0.0,2.5,8.5,0.2,1329.0,5476.0
...,...,...,...,...,...,...,...,...,...,...,...
3905,2024-11-18,NaN,NaN,NaN,NaN,NaN,2.8,7.9,-0.7,NaN,NaN
3906,2024-11-19,NaN,NaN,NaN,NaN,NaN,5.7,11.3,0.3,NaN,NaN
3907,2024-11-20,NaN,NaN,NaN,NaN,NaN,6.5,9.6,2.4,NaN,NaN
3908,2024-11-21,NaN,NaN,NaN,NaN,NaN,9.7,14.1,6.0,NaN,NaN
3909,2024-11-22,NaN,NaN,NaN,NaN,NaN,6.2,10.6,3.3,NaN,NaN

In [220]:
busstop3 = busstop3.rename(columns={'총승객수' : '버스정류장3_총승객수'})
df2 = pd.merge(df2, busstop3, how='outer', on='탑승일자')
df2

,탑승일자,1호선,4호선,공항철도,경의선,강수량범주,평균기온,최고기온,최저기온,버스정류장1_총승객수,버스정류장2_총승객수,버스정류장3_총승객수
0,2015-01-01,80394.0,14766.0,24498.0,2873.0,0.0,-7.7,-4.3,-9.8,1036.0,4239.0,706.0
1,2015-01-02,135476.0,30619.0,36337.0,7219.0,0.0,-6.0,-1.9,-9.0,1920.0,7239.0,246.0
2,2015-01-03,103156.0,21242.0,31520.0,4023.0,0.0,-2.7,3.1,-9.2,1507.0,5746.0,464.0
3,2015-01-03,103156.0,21242.0,31520.0,1.0,0.0,-2.7,3.1,-9.2,1507.0,5746.0,464.0
4,2015-01-04,86802.0,17294.0,28913.0,3590.0,0.0,2.5,8.5,0.2,1329.0,5476.0,409.0
...,...,...,...,...,...,...,...,...,...,...,...,...
3905,2024-11-18,NaN,NaN,NaN,NaN,NaN,2.8,7.9,-0.7,NaN,NaN,NaN
3906,2024-11-19,NaN,NaN,NaN,NaN,NaN,5.7,11.3,0.3,NaN,NaN,NaN
3907,2024-11-20,NaN,NaN,NaN,NaN,NaN,6.5,9.6,2.4,NaN,NaN,NaN
3908,2024-11-21,NaN,NaN,NaN,NaN,NaN,9.7,14.1,6.0,NaN,NaN,NaN
3909,2024-11-22,NaN,NaN,NaN,NaN,NaN,6.2,10.6,3.3,NaN,NaN,NaN

In [221]:
df2.to_csv("dataTotal.csv")

In [222]:
df2.isnull().sum()

탑승일자            0
1호선            22
4호선            23
공항철도           23
경의선            36
강수량범주          22
평균기온            0
최고기온            0
최저기온            0
버스정류장1_총승객수    27
버스정류장2_총승객수    26
버스정류장3_총승객수    26
dtype: int64